app/controllers/evaluation_sheets_controller.rb

SELECT "evaluation_sheets".* FROM "evaluation_sheets"
---
  def index
    @search = EvaluationSheet.search(params[:search])

SELECT "evaluation_sheets".* FROM "evaluation_sheets" WHERE "evaluation_sheets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @evaluation_sheet = EvaluationSheet.find(params[:id])

SELECT "evaluation_sheets".* FROM "evaluation_sheets" WHERE "evaluation_sheets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @evaluation_sheet = EvaluationSheet.find(params[:id])

SELECT "evaluation_sheets".* FROM "evaluation_sheets" WHERE "evaluation_sheets"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "evaluation_sheets" SET "date_of_receipt" = '2012-02-02', "updated_at" = '2013-02-14 10:03:18.199148' WHERE "evaluation_sheets"."id" = 1
---
  def update
    @evaluation_sheet = EvaluationSheet.find(params[:id])

    respond_to do |format|
      if @evaluation_sheet.update_attributes(params[:evaluation_sheet])

SELECT "evaluation_sheets".* FROM "evaluation_sheets" WHERE "evaluation_sheets"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "evaluation_sheets" WHERE "evaluation_sheets"."id" = ?  [["id", 2]]
---
  def destroy
    @evaluation_sheet = EvaluationSheet.find(params[:id])
    @evaluation_sheet.destroy